Revit 2027 API
BuiltInFailures.StairRampFailures.WinderMinWidthTooLargeForParallelTreadsFailure Property
 The value for Minimum Width on Inside Boundary is too large to satisfy the number of Parallel Treads at the Start or End as specified in the Run Instance properties.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId WinderMinWidthTooLargeForParallelTreadsFailure { get; }
Public Shared ReadOnly Property WinderMinWidthTooLargeForParallelTreadsFailure As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ WinderMinWidthTooLargeForParallelTreadsFailure {
	FailureDefinitionId^ get ();
}
static member WinderMinWidthTooLargeForParallelTreadsFailure : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.StairRampFailures Class
Autodesk.Revit.DB Namespace